Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་དྲུག་ཅུ་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་ཆོས་ཐམས་ཅད་དབྱེར་མ་མཆིས་ཤིང་། མཚན་མ་མ་མཆིས་ལ།
en: This completes the sixtieth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལགས་ན། ཇི་ལྟར་ན་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམས་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: Chapter 61 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, since all phenomena are indivisible, signless, and empty of their own defining characteristics, how could the cultivation of the six perfections, namely the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, be fulfilled?

source: ཟག་པ་དང་བཅས་པ་དང་ཟག་པ་མེད་པའི་ཆོས་དེ་དག་ཀྱང་། ཇི་ལྟར་ན་ཐ་དད་དུ་གྱུར་པར་གདའ་བ་ལགས།
en: How indeed are contaminated and uncontaminated phenomena differentiated?

source: ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འདུས་པ་ལགས།
en: How is the perfection of generosity gathered in the perfection of wisdom?

source: ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདུས་པ་ལགས།
en: How are the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, and the perfection of meditative concentration gathered in the perfection of wisdom?

source: ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་འདུས་པ་ལགས།
en: How are [all causal and fruitional attributes], up to and including the distinct qualities of the buddhas, gathered in the perfection of wisdom?

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་མཚན་ཉིད་ཀྱང་ཐ་དད་ལ། འདི་ལྟ་སྟེ། མཚན་ཉིད་མ་མཆིས་པར་མཚན་ཉིད་གཅིག་པར་གྱུར་པ་དེ་དག་རྣམ་པར་ཇི་ལྟ་བུར་གདགས་པར་འགྱུར། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Blessed Lord, how is it conceived that such phenomena do indeed have different defining characteristics when their sole defining characteristic is that they are without defining characteristics?”

source: །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྨི་ལམ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས་ཤིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་། །ཚུལ་ཁྲིམས་སྲུང་ངོ་། །བཟོད་པ་སྒོམ་མོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །ཏིང་ངེ་འཛིན་སྒོམ་མོ། །ཤེས་རབ་སྒོམ་མོ། །སྒྱུ་མ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། གཟུགས་བརྙན་ལྟ་བུ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་དང་།
en: The Blessed One replied to the venerable Subhūti, “In this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they dispense generosity, maintain ethical discipline, cultivate tolerance, undertake perseverance, cultivate meditative stability, and cultivate wisdom while abiding in the five acquisitive psycho-physical aggregates that are dreamlike.

source: སྤྲུལ་པ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས་ཤིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་། །ཚུལ་ཁྲིམས་སྲུང་ངོ་། །བཟོད་པ་སྒོམ་མོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །ཏིང་ངེ་འཛིན་སྒོམ་མོ། །ཤེས་རབ་སྒོམ་མོ།
en: They dispense generosity, maintain ethical discipline, cultivate tolerance, undertake perseverance, cultivate meditative stability, and cultivate wisdom while abiding in the five acquisitive psycho-physical aggregates that are like a magical display, like a mirage, like an optical aberration, like an echo, like a reflection, like a gandharva spirit town, and like a phantom.

source: །དེ་འདི་ལྟར་རྟོག་སྟེ། ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ནི་རྨི་ལམ་ལྟ་བུ་སྟེ། མཚན་ཉིད་མེད་པའོ། །ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ནི་སྒྱུ་མ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། གཟུགས་བརྙན་ལྟ་བུ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུ་སྟེ། མཚན་ཉིད་མེད་པའོ།
en: They should reflect that the five acquisitive psycho-physical aggregates, which are dreamlike, are without defining characteristics, and that the five acquisitive psycho-physical aggregates, which are like a magical display, like a mirage, like an optical aberration, like an echo, like a reflection, like a gandharva spirit town, and like a phantom, are without defining characteristics.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྨི་ལམ་ལ་རང་བཞིན་གང་ཡང་མེད་དོ། །སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཟླ་དང་མིག་ཡོར་དང་།
en: If you ask why, it is because a dream is without any essential nature, and a magical display, a mirage, an optical aberration, an echo, a reflection, a gandharva spirit town, and a phantom are without any essential nature. {

source: སྒྲ་བརྙན་དང་། གཟུགས་བརྙན་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་།
en: Ki.

source: སྤྲུལ་པ་ལ་རང་བཞིན་གང་ཡང་མེད་དོ།
en: VII: 30} Anything that is without essential nature is without defining characteristics.

source: །གང་ལ་རང་བཞིན་མེད་པ་དེ་ལ་མཚན་ཉིད་མེད་དེ། གང་མཚན་ཉིད་མེད་པ་དེ་ནི་འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའོ། །ཞེས་བྱ་བར་རྟོགས་པར་བྱེད་དེ།
en: That which is without defining characteristics has the sole defining characteristic that it is without defining characteristics. “

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། ཁྱོད་ཀྱིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ། སྦྱིན་པ་ནི་མཚན་ཉིད་མེད་པའོ། །གཏོང་བ་ནི་མཚན་ཉིད་མེད་པའོ། །ལེན་པ་ནི་མཚན་ཉིད་མེད་པའོ།
en: For this reason, Subhūti, you should know that generosity is without defining characteristics, the dispenser [of generosity] is without defining characteristics, and the recipient is without defining characteristics.

source: །ཞེས་བྱ་བར་ཤེས་པར་བྱ་སྟེ། གང་དེ་ལྟར་ཤེས་ནས་སྦྱིན་པ་གཏོང་བ་དེ་ནི། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡིན་ཏེ།
en: Those who dispense generosity [and so forth], while knowing this, fulfill the perfection of generosity.

source: དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་ན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཕྱིར་མི་ལྡོག་གོ །
en: When they fulfill the perfection of generosity they do not turn away from the perfection of ethical discipline.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ཕྱིར་མི་ལྡོག་གོ །
en: They do not turn away from the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: དེ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དེ་དག་ལ་གནས་ཤིང་། བསམ་གཏན་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དྲན་པ་ཉེ་བར་བཞག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Abiding in these six perfections, they perfect the four meditative concentrations, and they perfect the four immeasurable attitudes and the four formless absorptions.

source: །ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They perfect the four applications of mindfulness, and they perfect the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་།
en: They perfect the emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They perfect the meditative stability of emptiness, the meditative stability of signlessness, the meditative stability of wishlessness, the eight aspects of liberation, the nine serial steps of meditative absorption, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the kinds of exact knowledge, the ten powers of the tathāgatas, the four fearlessnesses, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas. “

source: །དེ་འཕགས་པའི་ཆོས་ཀྱང་འཇིག་རྟེན་ལས་འདས་པ་ཐུན་མོང་མ་ཡིན་པ། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་རྣམས་ལ་གནས་ཤིང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་གི་དྲུང་དུ་རྫུ་འཕྲུལ་གྱིས་སོང་ཞིང་། ན་བཟའ་དང་།
en: Abiding in these attributes of the noble ones, which arise from the maturation [of past actions] and are indeed supramundane and uncommon, they travel to the immeasurable, countless, and inestimable world systems of the ten directions through their miraculous ability, and approach all the lord buddhas who reside in them, and venerate them with robes, alms, bedding, medicines, and many useful things.

source: བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་མང་པོས་བསྙེན་བཀུར་བྱེད་དེ། ལོངས་སྤྱོད་དང་སྐྱིད་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ།
en: They act for the sake of beings through all sorts of resources and joys.

source: །དེ་ན་སེམས་ཅན་གང་སྦྱིན་པས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་ཀྱང་སྦྱིན་པས་ཡོངས་སུ་སྡུད་དོ།
en: They attract through their generosity those beings who are attracted by generosity.

source: །གང་ཚུལ་ཁྲིམས་ཀྱིས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་དང་། གང་བཟོད་པས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་དང་། གང་བརྩོན་འགྲུས་ཀྱིས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་དང་། གང་བསམ་གཏན་གྱིས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་དང་། གང་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་སྡུད་དོ།
en: They attract through their wisdom [and so forth] those who are attracted by ethical discipline, tolerance, perseverance, meditative concentration, and wisdom.

source: །གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱིས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་ཀྱང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱིས་ཡོངས་སུ་སྡུད་དོ།
en: They attract through all-aspect omniscience [and all the attributes and goals] those who are attracted by [all the attributes and goals], up to and including all-aspect omniscience.

source: །དེ་ལྟར་གང་དང་གང་དགེ་བའི་ཆོས་གང་དང་གང་གིས་ཡོངས་སུ་བསྡུ་བ་དེ་དག་ཀྱང་། དགེ་བའི་ཆོས་དེ་དང་དེ་དག་གིས་ཡོངས་སུ་སྡུད་དོ།
en: They attract through their respective virtuous attributes those who are attracted by the corresponding virtuous attributes.

source: །དེ་དགེ་བའི་རྩ་བ་དེ་དག་དང་ལྡན་ཞིང་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བས། འཁོར་བ་ཉེ་བར་ལེན་ཀྱང་། འཁོར་བའི་སྡུག་བསྔལ་གྱིས་མི་གོས་ཏེ།
en: Endowed with those roots of virtuous action and with mastery over all phenomena, they accept [rebirth] in cyclic existence, but are untainted by the sufferings of cyclic existence.

source: དེ་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་མི་དང་ལྷའི་ཕུན་སུམ་ཚོགས་པ་ཉེ་བར་ལེན་ཏེ།
en: For the sake of beings, they accept the excellent resources of gods and humans.

source: ཕུན་སུམ་ཚོགས་པ་དེ་དག་གིས། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་དོ།
en: They attract beings with those excellent resources.

source: །དེ་ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་པར་ཤེས་པས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཤེས་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: Knowing that all phenomena are without defining characteristics, they know the fruit of entering the stream to nirvāṇa but do not dwell in it.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཤེས་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: VII: 31} the fruit of no longer being subject to rebirth, and arhatship, but they do not dwell in them.

source: །རང་བྱང་ཆུབ་ཤེས་ཀྱང་དེ་ལ་མི་གནས་སོ།
en: They know individual enlightenment, but they do not dwell in it.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་ཆོས་ཐམས་ཅད་ཤེས་པར་བྱས་ཏེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཏེ།
en: If you ask why, it is because, having known all phenomena, they attain the all-aspect omniscience that is uncommon to the śrāvakas and pratyekabuddhas.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་པར་ཤེས་པས། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་མཚན་ཉིད་མེད་པར་ཤེས་སོ།
en: So it is, Subhūti, that bodhisattva great beings, who know all phenomena to be without defining characteristics, know that the six perfections are without defining characteristics.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མཚན་ཉིད་མེད་པར་ཤེས་སོ།
en: They know that [all the attributes and goals], up to and including all-aspect omniscience, are without defining characteristics. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྨི་ལམ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས། སྒྱུ་མ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། གཟུགས་བརྙན་ལྟ་བུ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of ethical discipline, while abiding in the five acquisitive psycho-physical aggregates that are dreamlike, and abiding in the five acquisitive psycho-physical aggregates that are like a magical display, like a mirage, like an optical aberration, like an echo, like a reflection, like a gandharva spirit town, and like a phantom.

source: སྤྲུལ་པ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཡང་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་རྨི་ལམ་ལྟ་བུར་ཤེས། སྒྱུ་མ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། ཆུ་ཟླ་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྲ་བརྙན་ལྟ་བུ་དང་། གཟུགས་བརྙན་ལྟ་བུ་
en: Subhūti, knowing the five acquisitive psycho-physical aggregates to be dreamlike, and knowing the five acquisitive psycho-physical aggregates to be like a magical display, like a mirage, like an optical aberration, like an echo, like a reflection, like a gandharva spirit town, and like a phantom, these bodhisattva great beings also complete the perfection of ethical discipline, which is without defining characteristics, undamaged, unimpaired, faultless, unsullied, nondegenerate, abundant in splendor, praised by the learned, utterly perfect, sublime, uncontaminated, included in the path, and supramundane. “

source: དང་། དྲི་ཟའི་གྲོང་ཁྱེར་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུར་ཤེས་ནས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཚན་ཉིད་མེད་པ། མ་ཞིག་པ། མ་རལ་བ། སྐྱོན་མེད་པ། རྙོག་པ་མེད་པ། ཉམས་པ་མེད་པ། དབང་དུ་གྱུར་པ། མཁས་པས་བསྔགས་པ། ཤིན་ཏུ་རྫོགས་པ། འཕགས་པར་གྱུར་པ། ཟག་པ་མེད་པ། ལམ་གྱི་ཁོངས་སུ་ཆུད་པ། འཇིག་རྟེན་ལས་འདས་པ། ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་ལ་གནས་ཤིང་། ཡང་དག་པར་བླང་བའི་བརྡ་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་དང་། ཆོས་ཉིད་ཀྱིས་ཐོབ་པའི་ཚུལ་ཁྲིམས་དང་། སྡོམ་པའི་ཚུལ་ཁྲིམས་དང་། དམིགས་པའི་ཚུལ་ཁྲིམས་དང་། སྤྱོད་པའི་ཚུལ་ཁྲིམས་དང་། མི་སྤྱོད་པའི་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: Maintaining these attributes, they maintain the conventional ethical disciplines in which precepts are adopted, and they also maintain ethical discipline acquired on the basis of the true nature, ethical discipline conjoined with restraint, ethical discipline that is apprehended, ethical discipline that is habitual, and ethical discipline that is not habitual.

source: །དེ་ཚུལ་ཁྲིམས་དེ་ལྟ་བུ་དང་ལྡན་ཡང་། འདིས་བདག་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་སྐལ་བ་མཉམ་པ་འམ། བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། སྐལ་བ་མཉམ་པར་སྐྱེ་བར་བྱའོ་ཞེ་འམ།
en: Endowed with such ethical disciplines, they do not assert the supremacy of anything at all, and so they lay no claims by thinking, ‘Through this ethical discipline, may I be reborn equal in fortune to the great and lofty royal families, or may I be reborn equal in fortune to the great and lofty priestly families, or among the great and lofty householder families!’

source: རྒྱལ་ཕྲན་ནམ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བར་བྱའོ་ཞེ་འམ།
en: They lay no claims by thinking, ‘May I become a minor king or a universal emperor!

source: རྒྱལ་ཆེན་བཞིའི་རིགས་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་བྱའོ་ཞེ་འམ། སུམ་ཅུ་རྩ་གསུམ་འམ།
en: May I be reborn equal in fortune to the gods of the Caturmahā­rāja­kāyika realm!

source: མཚེ་མ་འམ། དགའ་ལྡན་ནམ། འཕྲུལ་དགའ་འམ། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་བྱའོ་ཞེ་འམ།
en: May I be reborn equal in fortune to the gods of the Trayastriṃśa realm, to those of the Yāma realm, or those of the Tuṣita realm, those of the Nirmāṇarata realm, and those of the Para­nirmita­vaśa­vartin realm! {

source: རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་བྱའོ་ཞེ་འམ།
en: Ki.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ།
en: VII: 32} May I attain the fruit of one who has entered the stream to nirvāṇa!

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་བྱང་ཆུབ་བམ། བྱང་ཆུབ་ཐོབ་པར་བྱའོ་ཞེས་ཚུལ་ཁྲིམས་དེས་སྙེམས་པ་མེད་དོ།
en: May I attain the fruit of one destined for only one more rebirth, or the fruit of one no longer subject to rebirth, arhatship, individual enlightenment, or [unsurpassed, complete] enlightenment!’ “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་མཚན་ཉིད་མེད་པ་སྟེ།
en: If you ask why, it is because all phenomena are without defining characteristics.

source: འདི་ལྟར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་མཚན་ཉིད་གཅིག་པས་ན་མཚན་ཉིད་མེད་པའི་ཆོས་ཀྱི་མཚན་ཉིད་མེད་པའི་ཆོས་ཐོབ་པར་མི་རུང་ངོ་།
en: Since they have a sole defining characteristic—the defining characteristic of the essential nature of nonentity—phenomena that are without defining characteristics cannot acquire phenomena that are without defining characteristics.

source: །མཚན་ཉིད་ཐ་དད་པའི་ཆོས་ཀྱིས་ཀྱང་མཚན་ཉིད་ཐ་དད་པའི་ཆོས་ཐོབ་པར་མི་རུང་ངོ་།
en: Nor can phenomena that have dissimilar defining characteristics acquire phenomena that have dissimilar defining characteristics.

source: །མཚན་ཉིད་ཐ་དད་པ་འམ་མཚན་ཉིད་མེད་པའི་ཆོས་ཀྱིས་ཀྱང་། མཚན་ཉིད་ཐ་དད་པ་འམ། མཚན་ཉིད་མེད་པའི་ཆོས་ཐོབ་པར་མི་རུང་ངོ་།
en: Nor can phenomena with dissimilar defining characteristics or without defining characteristics acquire phenomena with dissimilar defining characteristics or without defining characteristics.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཚན་ཉིད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: So it is, Subhūti, that bodhisattva great beings who practice the perfection of wisdom will complete the perfection of ethical discipline that is without defining characteristics, and then embark on the maturity of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པའི་ཚེ། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་འཐོབ་སྟེ།
en: When they have embarked on the maturity of the bodhisattvas, they will accept that phenomena are nonarising.

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་ལྔ་རབ་ཏུ་ཐོབ་ནས། གཟུངས་ཀྱི་སྒོ་ལྔ་བརྒྱ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ལྔ་བརྒྱ་ལ་གནས་ཏེ།
en: When they engage in knowledge of the path, they will attain the five extrasensory powers that arise through the maturation [of past actions], and then they will dwell in the five hundred dhāraṇī gateways and the five hundred gateways of meditative stability.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད་ཅིང་།
en: Having attained the four kinds of exact knowledge, they will venerate the lord buddhas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་སྟེ། སེམས་ཅན་རྣམས་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་འཛིན་ཏོ།
en: Traveling from buddhafield to buddhafield, they will bring beings to maturation, and also acquire the buddhafields.

source: །དེ་འགྲོ་བ་ལྔའི་འཁོར་བ་ན་འཁོར་ཡང་། འཁོར་བའི་ལས་རྣམ་པར་སྨིན་པས་གོས་པར་མི་འགྱུར་ཏེ། འདི་ལྟར་དཔེར་ན་སྤྲུལ་པ་ནི་འགྲོ་བ་འམ། སྡོད་པ་འམ། འདུག་པ་འམ་ཉལ་བ་བྱེད་ཀྱང་དེ་ལ་འགྲོ་བ་འམ། འོང་བ་འམ།
en: Even if they frequent cyclic existence with its five classes of living beings, they will never be tainted by the ripening of past actions that is associated with cyclic existence.

source: སྡོད་པ་འམ། འདུག་པ་འམ། ཉལ་བ་འང་མི་དམིགས་ཏེ། དེ་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཀྱང་བྱེད་དོ། །སེམས་ཅན་དང་སེམས་ཅན་དུ་གདགས་པ་ཡང་མི་དམིགས་སོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་ཅུ་དྲུག་པ། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Just as a phantom may stand, move, rest, sit, or even lie down, but no going, coming, resting, sitting, or lying down is apprehended, in the same way they may even act on behalf of beings, but they do not apprehend beings or even the concept of a being. “

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤིན་དུ་ཞི་བ་ཞེས་བྱ་བ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ། སེམས་ཅན་ཚད་མེད་པ་ཐེག་པ་གཉིས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུ་གང་ཡང་མ་གཟིགས་ནས། དེས་ཚེའི་འདུ་བྱེད་སྤངས་ནས། སྤྲུལ་པ་སྤྲུལ་པ་མཛད་དེ། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །རབ་འབྱོར་དེ་ལྟར་སྤྲུལ་པ་དེས་བསྐལ་པ་གཅིག་ལོན་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏེ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ།
en: Subhūti, just as a tathāgata, arhat, completely awakened buddha, who is said to be utterly at peace, may attain consummate buddhahood in unsurpassed, complete enlightenment, and then turn the wheel of the Dharma, and even after causing immeasurable beings to attain final nirvāṇa through the two vehicles, may no longer discern any such bodhisattva prophesied to attain unsurpassed, complete enlightenment, and let go of the formative predispositions of his [current] lifespan while sending forth an emanation, and pass into final nirvāṇa in the expanse of nirvāṇa, where there is no residue of the psycho-physical aggregates—and that emanation, Subhūti, would then, after one eon has passed, prophesy bodhisattva great beings to attain unsurpassed, complete enlightenment and itself pass into final nirvāṇa, {Ki.

source: །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་དེའི་གཟུགས་སམ། ཚོར་བ་འམ་འདུ་ཤེས་སམ་འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པ་འམ། དངོས་པོ་གང་ཡང་དམིགས་སུ་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་སེམས་ཅན་ནམ་སེམས་ཅན་དུ་གདགས་པ་ཡང་མི་དམིགས་ལ་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཀྱང་བྱེད་དོ།
en: VII: 33} although no physical form, feelings, perceptions, formative predispositions, consciousness, or entity could be apprehended at all with respect to that [emanation] that has attained final nirvāṇa—in the same way, Subhūti, bodhisattva great beings do not apprehend beings or the concept of a being, and yet they indeed act on behalf of beings.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མཚན་ཉིད་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དེ་ཡོངས་སུ་རྫོགས་པས་མཚན་ཉིད་མེད་པའི་ཆོས་ཐམས་ཅད་ཁོངས་སུ་ཆུད་པར་ཤེས་སོ།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of ethical discipline without defining characteristics. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྨི་ལམ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས། སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་གནས་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of tolerance without defining characteristics, while abiding in the five acquisitive psycho-physical aggregates that are dreamlike, and abiding in the five acquisitive psycho-physical aggregates that are like an echo, like an optical aberration, like a magical display, like a mirage, and like a phantom. “
